/** 全局变量 */

var c = [
    "#bcbcb4", // 0.灰
    "#eeedeb", // 1.白灰
    "#fffbf0", // 2.象牙白
    "#0071bc", // 3.深蓝
    "#05a5ef", // 4.标蓝
    "#bfe5f0", // 5.浅蓝
    "#ffeb3b", // 6.金黄
    "#ff461f", // 7.朱砂
    "#e91e63", // 8.粉
    "#ab47bc", // 9.粉红
    "#5c6bc0", // 10.紫蓝
    "#7e57c2", // 11.紫
    "#2196f3", // 12.海蓝
    "#00bcd4", // 13.蓝
    "#26a69a", // 14.蓝绿
    "#4caf50", // 15.绿
    "#8bc34a", // 16.黄绿
    "#ffa726", // 17.橙
    "#78909c", // 18.蓝灰
    "#8d6e63", // 19.棕
    "#312520", // 20.煤黑
];
global.c_gray = [c[0], c[1], c[2]];
global.c_primary = [c[3], c[4], c[5]];
global.c_highlight = [c[6]];
global.c_fatal = [c[7]];
